#Область ПрограммныйИнтерфейс
// Получить результат поиска мест.
// 
// Параметры:
//  ТекстПоиска - Строка - Текст поиска
// 
// Возвращаемое значение:
//  Структура - Получить результат поиска мест
Функция ПолучитьРезультатПоискаМест(ТекстПоиска = "") Экспорт
	Результат = МодульИнтеграцииВызовСервера.ПолучитьМеста(ТекстПоиска);//Структура

	Возврат Результат;

КонецФункции



// Получить данные места.
// 
// Параметры:
//  Место - Строка - Место
// 
// Возвращаемое значение:
//  Структура, Произвольный - Получить данные места
Функция ПолучитьДанныеМеста(Место = "") Экспорт
	Результат = МодульИнтеграцииВызовСервера.ПолучитьКоординатыМеста(Место);//Структура

	Возврат Результат;

КонецФункции



// Получить адрес.
// 
// Параметры:
//  Наименование - Строка - Наименование
//  Долгота - Строка - Долгота
//  Широта - Строка - Широта
// 
// Возвращаемое значение:
//  СправочникСсылка.Адреса - Получить адрес
Функция ПолучитьАдрес(Наименование = "", Долгота = "", Широта = "") Экспорт

	Адрес = Справочники.Адреса.НайтиПоНаименованию(СокрЛП(Наименование), Истина);

	Если Не ЗначениеЗаполнено(Адрес) Тогда
		ОбъектАдрес = Справочники.Адреса.СоздатьЭлемент();
		ОбъектАдрес.Наименование = СокрЛП(Наименование);
		ОбъектАдрес.ПолноеНаименование = СокрЛП(Наименование);
		ОбъектАдрес.Долгота = Число(Долгота);
		ОбъектАдрес.Широта  = Число(Широта);
		ОбъектАдрес.Записать();
		Возврат ОбъектАдрес.Ссылка;
	КонецЕсли;

	Возврат Адрес;

КонецФункции

// Получить текст шаблона.
// 
// Возвращаемое значение:
//  Строка - Получить текст шаблона
Функция ПолучитьТекстШаблона() Экспорт

	ApiKey = Константы.YandexAPIKEY.Получить();

//	ТекстHTML = "<!DOCTYPE html>
//				|<html xmlns=""http://www.w3.org/1999/xhtml"">
//				|<head>
//				|    <title>Быстрый старт. Размещение интерактивной карты на странице</title>
//				|    <meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
//				|    <script src=""https://api-maps.yandex.ru/2.1/?apikey=%apikey%&lang=ru_RU"" type=""text/javascript"">
//				|    </script>
//				|    <script type=""text/javascript"">
//				|        ymaps.ready(init);
//				|        function init(){
//				|            var myMap = new ymaps.Map(""map"", {
//				|                center: [40.372966, 49.853128],
//				|                zoom: 11
//				|            });
//				|        }
//				|    </script>
//				|<style>
//				|#map {
//				|  height: 100%;
//				|}
//				|
//				| html,
//				| body {
//				| height: 100%;
//				| margin: 0;
//				| padding: 0;
//				|}
//				|</style>
//				|</head>
//				|
//				|<body>
//				|    <div id=""map""></div>
//				|</body>
//				|
//				|</html>";

    МакетHTML = ПолучитьМакет("ШаблонКарты");
    ТекстHTML = МакетHTML.ПолучитьТекст();
	ТекстHTML = СтрЗаменить(ТекстHTML,"%apikey%",ApiKey);

	Возврат ТекстHTML;

КонецФункции
#КонецОбласти