
&НаКлиенте
Асинх Процедура СтрокаПоискаПриИзменении(Элемент)
	Элементы.СтрокаПоиска.СписокВыбора.Очистить();
	НачалоПоиска(СтрокаПоиска);
	ВыбранноеЗначение = Ждать ВыбратьИзМенюАсинх(Элементы.СтрокаПоиска.СписокВыбора,Элементы.СтрокаПоиска );
	
	Если ВыбранноеЗначение <> Неопределено Тогда
       СтрокаПоиска = ВыбранноеЗначение.Значение;
       ПолучитьДанныеМеста();		
	Иначе
		СтрокаПоиска = "";
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура НачалоПоиска(Текст)
  Если СтрДлина(Текст) > 3 Тогда
  	НачалоПоискаНаСервере(Текст);
  КонецЕсли;
КонецПроцедуры



&НаСервере
Процедура ПолучитьДанныеМеста()
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	РезультатПоиска = ОбъектОбработки.ПолучитьДанныеМеста(СтрокаПоиска);
	
	Если РезультатПоиска.Свойство("response")
	И РезультатПоиска.response.Свойство("GeoObjectCollection")
	И РезультатПоиска.response.GeoObjectCollection.featureMember.Количество() > 0 Тогда
		
		Точка = РезультатПоиска.response.GeoObjectCollection.featureMember[0].GeoObject.Point.pos;
		
		СимволРазделителя = СтрНайти(Точка," " );
		
		Долгота = СокрЛП(Лев(Точка,СимволРазделителя));
		
		Широта  = СокрЛП(Сред(Точка,СимволРазделителя));
		
        Адрес  = ОбъектОбработки.ПолучитьАдрес(СокрЛП(СтрокаПоиска),Долгота ,Широта);
		
	КонецЕсли;
	
	Элементы.СтрокаПоиска.СписокВыбора.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
   Если Не ЗначениеЗаполнено(Константы.MappableAPIKey.Получить()) Тогда
   	Сообщить("Заполните API KEY (Mappble)!");
   	Элементы.СтрокаПоиска.Доступность = Ложь;
   КонецЕсли;

КонецПроцедуры




&НаСервере
Процедура НачалоПоискаНаСервере(Текст)
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	РезультатПоиска = ОбъектОбработки.ПолучитьРезультатПоискаМест(Текст);
	
	Если РезультатПоиска.Свойство("results") Тогда
		Для Каждого Элемент Из РезультатПоиска.results Цикл
			Элементы.СтрокаПоиска.СписокВыбора.Добавить(Элемент.title.text);
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры
